cpetools/message/Inform.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:cwmp1="urn:dslforum-org:cwmp-1-1">
 <SOAP-ENV:Header>
  <cwmp1:HoldRequests SOAP-ENV:mustUnderstand="">false</cwmp1:HoldRequests>
  <cwmp1:ID SOAP-ENV:mustUnderstand=""></cwmp1:ID>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <cwmp1:Inform>
    <DeviceId>
     <Manufacturer></Manufacturer>
     <OUI></OUI>
     <ProductClass></ProductClass>
     <SerialNumber></SerialNumber>
    </DeviceId>
    <Event SOAP-ENC:arrayType="cwmp1:EventStruct[1]">
     <EventStruct>
      <EventCode></EventCode>
      <CommandKey></CommandKey>
     </EventStruct>
    
     <EventStruct>
      <EventCode></EventCode>
      <CommandKey></CommandKey>
     </EventStruct>
    </Event>
    <MaxEnvelopes>0</MaxEnvelopes>
    <CurrentTime>2011-08-05T08:32:29Z</CurrentTime>
    <RetryCount>0</RetryCount>
    <ParameterList SOAP-ENC:arrayType="cwmp1:ParameterValueStruct[1]">
     <ParameterValueStruct>
      <Name></Name>
      <Value></Value>
     </ParameterValueStruct>
    
     <ParameterValueStruct>
      <Name></Name>
      <Value></Value>
     </ParameterValueStruct>
    </ParameterList>
   </cwmp1:Inform>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
